# Checking Pandas Version
The version string is stored under __version__ attribute.

In [27]:
import pandas as pd

print(pd.__version__)

2.3.3

# Pandas Series
A Pandas Series is like a column in a table.
It is a one-dimensional array holding data of any type.

In [28]:
import pandas as pd

a = [1, 7, 2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

The describe function provides statistical insights into our data, we used to
use different function in numpy to obtain such inofrmation, but with pandas
employing describe alone is sufficient.

we have the flexibility to tailor the information obtained from describe using the
agg command based on our specific requirements.

In [29]:
data=pd.Series([1,2,3,4,5,6,7,8,9,10])
print(data.describe())

count    10.00000
mean      5.50000
std       3.02765
min       1.00000
25%       3.25000
50%       5.50000
75%       7.75000
max      10.00000
dtype: float64

In [30]:
print(data.agg(['max','min','sum','mean','std','var','count']))

max      10.000000
min       1.000000
sum      55.000000
mean      5.500000
std       3.027650
var       9.166667
count    10.000000
dtype: float64

In [31]:
print(data.info())

<class 'pandas.core.series.Series'>
RangeIndex: 10 entries, 0 to 9
Series name: None
Non-Null Count  Dtype
--------------  -----
10 non-null     int64
dtypes: int64(1)
memory usage: 212.0 bytes
None

# Accessing data

## Labels
If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.

This label can be used to access a specified value.

In [32]:
import pandas as pd
a = [1, 7, 2]
myvar = pd.Series(a)
print(myvar)
# return the first value of series
print(myvar[0])

0    1
1    7
2    2
dtype: int64
1

With the index argument, you can name your own labels.

In [33]:
import pandas as pd

a=[1,2,3,4,5]
Series=pd.Series(a,index=['a','b','c','d','e'])
print(Series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [34]:
print(Series['a'])

1

we can use key:value pair (dictionary) to create series

In [35]:
import pandas as pd

A={"1st month":"jan",
   "2nd month":"feb",
   "3rd month":"march",
   "4th month":"apr"}
myvar=pd.Series(A)
print(myvar)

1st month      jan
2nd month      feb
3rd month    march
4th month      apr
dtype: object

we can specify which element of dictionary we want in series

In [36]:
myvar2=pd.Series(A,index=["1st month","2nd month"])
print(myvar2)

1st month    jan
2nd month    feb
dtype: object

#### Slicing index

In [37]:
import pandas as pd

A_series=pd.Series([1.23,2.34,3.45,4.56,5.67])
print("using slicing to access specific data\n", A_series[2:])
print("using steps to accsses specific data\n", A_series[0::2])

using slicing to access specific data
 2    3.45
3    4.56
4    5.67
dtype: float64
using steps to accsses specific data
 0    1.23
2    3.45
4    5.67
dtype: float64

# Data Frames(Tables)

Data sets in Pandas are usually multi-dimensional tables, called DataFrames.
Series is like a column, a DataFrame is the whole table.

### Creating DataFrame

There are various ways to create Data frames (DF) in pandas, including using
arrays and series.

We will explore each method in this notebook, but you will notice that the DF
class requires several optional parameters, such as index, column names, and
others.

However, one parameter is mandatoryâ€” the data itself (either an array or a
series)

#### Creating Dataframe from Array

It's essential to note that the length of the index list should match the number of rows
in the data, and similarly, the length of the columns list should correspond to the
number of columns in the provided data.

In [38]:
import pandas as pd
import numpy as np

#actual data
Data=np.array([[1,2,3,4],
               [5,6,7,8],
               [9,10,11,12],
               [13,14,15,16]])

#Naming rows
Row=np.array(["Row1","Row2","Row3","Row4"])
#Naming columns
Column=np.array(["Col1","Col2","Col3","Col4"])
#Creating dataframe
DataFrame=pd.DataFrame(Data, index=Row, columns=Column)

print(DataFrame)

      Col1  Col2  Col3  Col4
Row1     1     2     3     4
Row2     5     6     7     8
Row3     9    10    11    12
Row4    13    14    15    16

#### Creating Dataframe from list

In [39]:
import pandas as pd

Data=[["Sumit pandey",20,"Hotel Manager"],
      ["Shubham Kanojiya",24,"Clinic owner"],
      ["Akshy Maurya",25,"Production Manger"],
      ["Ayush Kharawar",30,"Police officer"],
      ["Sarvesh Maurya",29,"ML Engeener"]]

#define column name 
Column_name=["Name","age","Proffesion"]
#creating data frame
DataFrame=pd.DataFrame(Data, columns= Column_name)

print(DataFrame)

               Name  age         Proffesion
0      Sumit pandey   20      Hotel Manager
1  Shubham Kanojiya   24       Clinic owner
2      Akshy Maurya   25  Production Manger
3    Ayush Kharawar   30     Police officer
4    Sarvesh Maurya   29        ML Engeener

#### creating Dataframe from Series

As previously mentioned, a Series is essentially a 1D matrix. If you have multiple
Series, you can combine them to create a DataFrame.

In [40]:
import pandas as pd

w=pd.Series({'A':1,'B':2,'C':3,'D':4})
x=pd.Series({'A':5,'B':6,'C':7,'D':8})
y=pd.Series({'A':9,'B':10,'C':11,'D':12})
z=pd.Series({'A':13,'B':14,'C':15,'D':16})

df=pd.DataFrame({'a':w,'b':x,'c':y,'d':z})
print(df)

   a  b   c   d
A  1  5   9  13
B  2  6  10  14
C  3  7  11  15
D  4  8  12  16

#### creating dataframe from dictionary

We can create DF by dictionary methods column by column and using the conditions
for fill the values

In [41]:
import pandas as pd

Data=[{'Square':i**2,'Cube':i**3,"Square root":i**0.5} for i in range(20)]
df=pd.DataFrame(Data)

print(df.to_string())

    Square  Cube  Square root
0        0     0     0.000000
1        1     1     1.000000
2        4     8     1.414214
3        9    27     1.732051
4       16    64     2.000000
5       25   125     2.236068
6       36   216     2.449490
7       49   343     2.645751
8       64   512     2.828427
9       81   729     3.000000
10     100  1000     3.162278
11     121  1331     3.316625
12     144  1728     3.464102
13     169  2197     3.605551
14     196  2744     3.741657
15     225  3375     3.872983
16     256  4096     4.000000
17     289  4913     4.123106
18     324  5832     4.242641
19     361  6859     4.358899

# operations on Dataframe

#### Transpose th DF

In [42]:
print(grades.T)

NameError: name 'grades' is not defined

#### Accessing only keys or values of DF

Note : Keys --> Columns header

In [ ]:
print(grades.keys(),"\n")
print(grades.values)

Index(['Math', 'Physics', 'French', 'Chemistry', 'Hindi'], dtype='object')

[[ 1  6 11 16  7]
 [ 2  7 12 17  9]
 [ 3  8 13 18 11]
 [ 4  9 14 19 13]
 [ 5 10 15 20 15]]

#### applying conditions

In [ ]:
print("math" in grades)
print("Math" in grades)

False
True

####  Vertical representation of elements with keys and values

In [ ]:
print(grades.stack())

a  Math          1
   Physics       6
   French       11
   Chemistry    16
   Hindi         7
b  Math          2
   Physics       7
   French       12
   Chemistry    17
   Hindi         9
c  Math          3
   Physics       8
   French       13
   Chemistry    18
   Hindi        11
d  Math          4
   Physics       9
   French       14
   Chemistry    19
   Hindi        13
e  Math          5
   Physics      10
   French       15
   Chemistry    20
   Hindi        15
dtype: int64

####  Locating specific elements for slicing and searching within the DF
We have two primary methods for this task:

Method 1: iloc (i for index) - It locates the position by index, similar to the method we
are familiar with in lists.

Example: --> iloc[:3, :2]

Method 2: loc - You need to specify the names of the elements, rows, and columns
you are searching for.

Example: --> loc["b":"c", "Math":] This implies selecting rows from 'b' to 'c' and
columns from 'Math' to the end.

Note: In this method, you need to reference columns by their names. If the index is
numeric, you can use numbers.

Example: df.loc[3:6, : "Square of x"]

In [ ]:
import pandas as pd

w = pd.Series({'a':1 ,'b':2 ,'c':3 ,'d':4 ,'e':5})
x = pd.Series({'a':6 ,'b':7 ,'c':8 ,'d':9 ,'e':10})
y = pd.Series({'a':11 ,'b':12 ,'c':13 ,'d':14 ,'e':15})
z = pd.Series({'a':16 ,'b':17 ,'c':18 ,'d':19 ,'e':20})

grades = pd.DataFrame({'Math':w,'Physics':x,'French':y,'Chemistry':z})
print(grades.iloc[:4,:2])

   Math  Physics
a     1        6
b     2        7
c     3        8
d     4        9

In [ ]:
print(grades.loc["a":,"Physics":],"\n")
print(grades.loc["a":"c"],"\n")
print(grades.loc[grades.Math>2])

   Physics  French  Chemistry
a        6      11         16
b        7      12         17
c        8      13         18
d        9      14         19
e       10      15         20

   Math  Physics  French  Chemistry
a     1        6      11         16
b     2        7      12         17
c     3        8      13         18

   Math  Physics  French  Chemistry
c     3        8      13         18
d     4        9      14         19
e     5       10      15         20

In [ ]:
#slecting marks of physics and french where math have greater than 2 score
print(grades.loc[grades.Math>2,['Physics','French']])

   Physics  French
c        8      13
d        9      14
e       10      15

In [ ]:
#Access names of all columns and the index in the DF
print(grades.index)
print(grades.columns)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
Index(['Math', 'Physics', 'French', 'Chemistry'], dtype='object')

## sorting

Sorting the DataFrame based on the values of a specific column in ascending or
descending order (using the parameter ascending=False if needed).

In [ ]:
print(grades.sort_values(['Math'],ascending=False),"\n")
print(grades.sort_values(['Math'],ascending=True))

   Math  Physics  French  Chemistry
e     5       10      15         20
d     4        9      14         19
c     3        8      13         18
b     2        7      12         17
a     1        6      11         16

   Math  Physics  French  Chemistry
a     1        6      11         16
b     2        7      12         17
c     3        8      13         18
d     4        9      14         19
e     5       10      15         20

### Statistics for the entire DF or per column

In [ ]:
import pandas as pd

w = pd.Series({'a':1 ,'b':2 ,'c':3 ,'d':4 ,'e':5})
x = pd.Series({'a':6 ,'b':7 ,'c':8 ,'d':9 ,'e':10})
y = pd.Series({'a':11 ,'b':12 ,'c':13 ,'d':14 ,'e':15})
z = pd.Series({'a':16 ,'b':17 ,'c':18 ,'d':19 ,'e':20})

grades = pd.DataFrame({'Math':w,'Physics':x,'French':y,'Chemistry':z})

#applying max in all the colmns in table
print("appying max in entire table\n",grades.max(),"\n")

#applying min in all the colmns in table
print("appying min in entire table\n",grades.min(),"\n")

appying max in entire table
 Math          5
Physics      10
French       15
Chemistry    20
dtype: int64

appying min in entire table
 Math          1
Physics       6
French       11
Chemistry    16
dtype: int64

In [ ]:
print("max in only one column\n",grades["Math"].max())
print("min in only one column\n",grades["Math"].min())
print("mean in only one column\n",grades["Math"].mean())

max in only one column
 5
min in only one column
 1
mean in only one column
 3.0

### The correlation between elements in the DF

When the numbers are closely aligned, the correlation tends to approach 1, and
conversely, when they are distant, the correlation tends to be closer to -1.

In [ ]:
print(grades.corr())

           Math  Physics  French  Chemistry
Math        1.0      1.0     1.0        1.0
Physics     1.0      1.0     1.0        1.0
French      1.0      1.0     1.0        1.0
Chemistry   1.0      1.0     1.0        1.0

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.rand(5, 3), columns=['A', 'B', 'C'])
print(df)
print(df.corr())

          A         B         C
0  0.662171  0.193639  0.585838
1  0.920654  0.586735  0.096716
2  0.648970  0.033186  0.473115
3  0.644394  0.036297  0.277901
4  0.524745  0.031732  0.456824
          A         B         C
A  1.000000  0.935063 -0.743119
B  0.935063  1.000000 -0.667079
C -0.743119 -0.667079  1.000000

### The skewness among the elements of each column in the DF

The df.skew() function yields a Series, providing one value for each column in the
DataFrame. These Series values represent the skewness of each corresponding
column.

In [ ]:
print(grades.skew())

Math         0.0
Physics      0.0
French       0.0
Chemistry    0.0
dtype: float64

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.rand(5, 3), columns=['A', 'B', 'C'])
print(df,"\n")
print(df.skew())

          A         B         C
0  0.352020  0.240203  0.953740
1  0.911421  0.490358  0.720257
2  0.787926  0.706012  0.121096
3  0.138388  0.114476  0.013486
4  0.010248  0.091865  0.873791

A    0.264697
B    0.777113
C   -0.483022
dtype: float64

### Arithmetic operations between Columns
We have two options:

Applying the arithmetic operation directly
Utilizing the DataFrame method ( eval ).
However, please note that when using the pandas method, you need to
specify the operation as text

In [ ]:
import pandas as pd
w = pd.Series({'a':1 ,'b':2 ,'c':3 ,'d':4 ,'e':5})
x = pd.Series({'a':6 ,'b':7 ,'c':8 ,'d':9 ,'e':10})
y = pd.Series({'a':11 ,'b':12 ,'c':13 ,'d':14 ,'e':15})
z = pd.Series({'a':16 ,'b':17 ,'c':18 ,'d':19 ,'e':20})
grades = pd.DataFrame({'Math':w,'Physics':x,'French':y,'Chemistry':z})

print(grades)

grades["total_marks%"]=((grades["Math"]+grades["French"]+grades["Physics"]+grades["Chemistry"])/80)*100

print(grades)

   Math  Physics  French  Chemistry
a     1        6      11         16
b     2        7      12         17
c     3        8      13         18
d     4        9      14         19
e     5       10      15         20
   Math  Physics  French  Chemistry  total_marks%
a     1        6      11         16          42.5
b     2        7      12         17          47.5
c     3        8      13         18          52.5
d     4        9      14         19          57.5
e     5       10      15         20          62.5

In [ ]:
#Performing calculations using the evaluation method of Pandas
result=pd.eval('(grades.Math + grades.French + grades.Chemistry + grades.Physics)*100/80')
print(result)

a    42.5
b    47.5
c    52.5
d    57.5
e    62.5
dtype: float64

### Selecting a Specific Row by Conditions
Similarly, for selection, you can either do it manually or use the Pandas
method (query).
However, when utilizing the Pandas method, remember to express the operation as text

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.rand(5, 3), columns=['A', 'B', 'C'])
result = df.query('A < 0.5 and B < 0.5')
print(df)
print(result)

          A         B         C
0  0.008083  0.601827  0.229567
1  0.946103  0.722689  0.449825
2  0.379535  0.816576  0.912101
3  0.460405  0.081446  0.602616
4  0.550459  0.353104  0.508758
          A         B         C
3  0.460405  0.081446  0.602616

In [ ]:
import pandas as pd

w = pd.Series({'a':1 ,'b':2 ,'c':3 ,'d':4 ,'e':5})
x = pd.Series({'a':6 ,'b':7 ,'c':8 ,'d':9 ,'e':10})
y = pd.Series({'a':11 ,'b':12 ,'c':13 ,'d':14 ,'e':15})
z = pd.Series({'a':16 ,'b':17 ,'c':18 ,'d':19 ,'e':20})
grades = pd.DataFrame({'Math':w,'Physics':x,'French':y,'Chemistry':z})

result1=grades.query('Math>2 and Physics>5')
result2=grades.query('Math>2 or Physics>5')

print('Math>2 and Physics>5\n',result1,"\n")
print('Math>2 or Physics>5\n',result2)

Math>2 and Physics>5
    Math  Physics  French  Chemistry
c     3        8      13         18
d     4        9      14         19
e     5       10      15         20

Math>2 or Physics>5
    Math  Physics  French  Chemistry
a     1        6      11         16
b     2        7      12         17
c     3        8      13         18
d     4        9      14         19
e     5       10      15         20

In [ ]:
#similarlly

result3=grades[(grades.Math>2) & (grades.Physics>5)]
print('Math>2 and (&) Physics>5\n',result3,"\n")


result4=grades[(grades.Math>2) | (grades.Physics>5)]
print('Math>2 or (|) Physics>5\n',result4)

Math>2 and (&) Physics>5
    Math  Physics  French  Chemistry
c     3        8      13         18
d     4        9      14         19
e     5       10      15         20

Math>2 or (|) Physics>5
    Math  Physics  French  Chemistry
a     1        6      11         16
b     2        7      12         17
c     3        8      13         18
d     4        9      14         19
e     5       10      15         20

# Table concatination and merging

### Simple Concatenation

The concat() function does all of the heavy lifting of performing concatenation
operations along an axis while performing optional set logic (union or intersection) of
the indexes (if any) on the other axes.

In [ ]:
import pandas as pd

df1 = pd.DataFrame(
 {
 "A": ["A0", "A1", "A2", "A3"],
 "B": ["B0", "B1", "B2", "B3"],
 "C": ["C0", "C1", "C2", "C3"],
 "D": ["D0", "D1", "D2", "D3"],
 },
 index=[0, 1, 2, 3],
)

df2 = pd.DataFrame(
 {
 "A": ["A4", "A5", "A6", "A7"],
 "B": ["B4", "B5", "B6", "B7"],
 "C": ["C4", "C5", "C6", "C7"],
 "D": ["D4", "D5", "D6", "D7"],
 },
 index=[4, 5, 6, 7],
)

df3 = pd.DataFrame(
 {
 "A": ["A8", "A9", "A10", "A11"],
 "B": ["B8", "B9", "B10", "B11"],
 "C": ["C8", "C9", "C10", "C11"],
 "D": ["D8", "D9", "D10", "D11"],
 },
 index=[8, 9, 10, 11],
)

df4 = pd.DataFrame(
 {
 "B": ["B2", "B3", "B6", "B7"],
 "D": ["D2", "D3", "D6", "D7"],
 "F": ["F2", "F3", "F6", "F7"],
 },
 index=[2, 3, 6, 7],
)

print("df1\n",df1,"\n"*2,
      "df2\n",df2,"\n"*2,
      "df3\n",df3,"\n"*2,
      "df4\n",df4)

df1
     A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

 df2
     A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

 df3
       A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

 df4
     B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [ ]:
Windows=[df1,df2,df3]
new_df=pd.concat(Windows)
new_df

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

To add key for each DF in the resultant DF

In [ ]:
Windows2=[df1,df2,df3]
new_df2=pd.concat(Windows,keys=['DF1','DF2','DF3'])
new_df2

          A    B    C    D
DF1 0    A0   B0   C0   D0
    1    A1   B1   C1   D1
    2    A2   B2   C2   D2
    3    A3   B3   C3   D3
DF2 4    A4   B4   C4   D4
    5    A5   B5   C5   D5
    6    A6   B6   C6   D6
    7    A7   B7   C7   D7
DF3 8    A8   B8   C8   D8
    9    A9   B9   C9   D9
    10  A10  B10  C10  D10
    11  A11  B11  C11  D11

### Set logic on the other axes (join outer and inner)

When gluing together multiple DataFrames, you have a choice of how
to handle the other axes (other than the one being concatenated). This
can be done in the following two ways:

Take the union of them all, join='outer'. This is the default option as it results in
zero information loss.

Take the intersection, join='inner'.

In [ ]:
#example for outer join

result=pd.concat([df1,df4],axis=1)
print("df1\n",df1,"\n")
print("df4\n",df4)
result

df1
     A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

df4
     B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [ ]:
# example for inner join

result=pd.concat([df1,df4],axis=1,join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

### Ignoring indexes on the concatenation axis

For DataFrame objects which donâ€™t have a meaningful index, you may wish to append
them and ignore the fact that they may have overlapping indexes.
To do this, use the ignore_index argument:

In [ ]:
result=pd.concat([df1,df4],ignore_index=True)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

### Merging dataframe

When merging two DataFrames, Pandas will search for any common column and use
it as the basis for the merge. If no common column is found, Pandas will introduce
NaN values in the resulting DataFrame.

In [ ]:
import pandas as pd

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'group': ['Accounting', 'Engineering',
 'Engineering', 'HR']})

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
 'hire_date': [2004, 2008, 2012, 2014]})


print("DF1\n",df1,"\n")
print("DF2\n",df2,"\n")

DF1
   employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

DF2
   employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [ ]:
df3=pd.merge(df1,df2)
df3

#here Employee is acting as primary key to merge both dataframes

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

adding more dataframes

In [ ]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
 'supervisor': ['Carly', 'Guido', 'Steve']})
print("df4\n",df4,"\n")

df5 = pd.merge(df3, df4)
df5

df4
          group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

Merging two DataFrames and specifying which one is on the
left and which one is on the right.

In [45]:
import pandas as pd


df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'group': ['Accounting', 'Engineering',
 'Engineering', 'HR']})

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
 'hire_date': [2004, 2008, 2012, 2014]})

df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'salary': [70000, 80000, 120000, 90000]})


print(df1)
print(df3)

result1=pd.merge(df1,df3, left_on="employee", right_on="name")
result1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

### Set logic on the other axes during merging

Important Note:

In pandas axis = 1 parameter specifies that the operation should be performed
on the columns of the DataFrame

In pandas axis = 0 parameter specifies that the operation should be performed
on the rows of the DataFrame

In [14]:
import pandas as pd

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'group': ['Accounting', 'Engineering',
 'Engineering', 'HR']})

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
 'hire_date': [2004, 2008, 2012, 2014]})

df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'salary': [70000, 80000, 120000, 90000]})

print(df1,"\n")
print(df3)

pd.merge(df1,df3, left_on="employee", right_on="name").drop("name",axis=1)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

When merging, only the intersecting elements in the common
column will appear in the resulting DataFrame.

In [17]:
import pandas as pd


df1 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
 'food': ['fish', 'beans', 'bread']},
 columns=['name', 'food'])

df2 = pd.DataFrame({'name': ['Mary', 'Joseph'],
 'drink': ['cola', '7 up']},
 columns=['name', 'drink'])

pd.merge(df1,df2)
#here only row of mary is common in both the df

   name   food drink
0  Mary  bread  cola

The same intersection between DataFrames can be achieved by using
the "inner" parameter.

It's worth noting that "inner" is the default value for the parameter in
the Pandas merge method.

In [18]:
pd.merge(df1,df2,how="inner")

   name   food drink
0  Mary  bread  cola

Merging to obtain all elements, with NaN filling in the missing values,
using the "outer" parameter.

In [19]:
pd.merge(df1,df2,how="outer")

     name   food drink
0  Joseph    NaN  7 up
1    Mary  bread  cola
2    Paul  beans   NaN
3   Peter   fish   NaN

Merging to obtain all elements from one DataFrame and filling in
missing values in the other DataFrame with NaN, using the "right"
parameter.

In [20]:
pd.merge(df1,df2,how='right')

     name   food drink
0    Mary  bread  cola
1  Joseph    NaN  7 up

Merging to obtain all elements from one DataFrame and filling in
missing values in the other DataFrame with NaN, using the "left"
parameter.

In [21]:
pd.merge(df1,df2,how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  cola

# Advanced operations on DataFrames

#### stastics on entire df

In [43]:
import pandas as pd
from numpy import random as rd
df=pd.DataFrame(
    {"A":rd.random(10),
    "B":rd.random(10),
    "C":rd.random(10)}
                 )
df

          A         B         C
0  0.581253  0.411233  0.064434
1  0.504476  0.335508  0.490825
2  0.611739  0.174407  0.690970
3  0.979917  0.518113  0.764526
4  0.975670  0.215507  0.325485
5  0.898222  0.291304  0.700509
6  0.013766  0.964233  0.182303
7  0.647126  0.618212  0.260156
8  0.998384  0.735202  0.916417
9  0.803554  0.401583  0.810366

In [46]:
print("\nSUM\n",df.sum())
print("\nCOUNT\n",df.count())
print("\nMEAN\n",df.mean())
print("\nPRODUCT\n",df.prod())

SUM
 A    7.014108
B    4.665301
C    5.205991
dtype: float64

COUNT
 A    10
B    10
C    10
dtype: int64

MEAN
 A    0.701411
B    0.466530
C    0.520599
dtype: float64

PRODUCT
 A    0.001101
B    0.000138
C    0.000134
dtype: float64

#### Statistics on one Column of the DF

In [50]:
print("\nsum on column A\n",df["A"].sum())
print("\nproduct on column A\n",df["A"].prod())
print("\nmean on column A\n",df["A"].mean())
print("\nmedian on column A\n",df["A"].median())

sum on column A
 7.014108321136141

product on column A
 0.0011009629217569158

mean on column A
 0.7014108321136141

median on column A
 0.7253402376078032

#### Statistics on all rows of the DF

In this case, you need to pass the parameter axis="column".

This allows the process to be applied to all elements by column and
return results for each row.

In [ ]:
df.mean(axis='columns')

0    0.352307
1    0.443603
2    0.492372
3    0.754185
4    0.505554
5    0.630012
6    0.386767
7    0.508498
8    0.883334
9    0.671834
dtype: float64

## Groupby
Groupby is a crucial method in Pandas that facilitates grouping similar
elements and applying various operations on each group.

In [70]:
import pandas as pd

df = pd.DataFrame({'key':['A','B','C','A','B','C'],
 'data': range(1,7)},columns=['key', 'data'])
df

  key  data
0   A     1
1   B     2
2   C     3
3   A     4
4   B     5
5   C     6

In [71]:
#group by with agg method
df.groupby('key').agg(['sum','mean','count'])

    data
     sum mean count
key
A      5  2.5     2
B      7  3.5     2
C      9  4.5     2

In [ ]:
#goupby with discribe method
df.groupby('key').describe()

     data
    count mean      std  min   25%  50%   75%  max
key
A     2.0  2.5  2.12132  1.0  1.75  2.5  3.25  4.0
B     2.0  3.5  2.12132  2.0  2.75  3.5  4.25  5.0
C     2.0  4.5  2.12132  3.0  3.75  4.5  5.25  6.0

In [ ]:
#Unstack the returned data from the describe method.
df.groupby('key').describe().unstack()

             key
data  count  A      2.00000
             B      2.00000
             C      2.00000
      mean   A      2.50000
             B      3.50000
             C      4.50000
      std    A      2.12132
             B      2.12132
             C      2.12132
      min    A      1.00000
             B      2.00000
             C      3.00000
      25%    A      1.75000
             B      2.75000
             C      3.75000
      50%    A      2.50000
             B      3.50000
             C      4.50000
      75%    A      3.25000
             B      4.25000
             C      5.25000
      max    A      4.00000
             B      5.00000
             C      6.00000
dtype: float64

In [136]:
#using function to filter

import pandas as pd
import numpy as np

df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
 'data1': range(6),
 'data2': np.random.randint(0, 10, 6)},
 columns = ['key', 'data1', 'data2'])

print(df)

def filter_func(x):
 return x['data2'].sum() > 4

df2 = df.groupby('key').filter(filter_func)
df2

  key  data1  data2
0   A      0      4
1   B      1      6
2   C      2      1
3   A      3      9
4   B      4      6
5   C      5      2

  key  data1  data2
0   A      0      4
1   B      1      6
3   A      3      9
4   B      4      6

In [163]:
def filter_fuc(x):
    return x['data1'].sum()>4

df21=df.groupby('key').filter(filter_fuc)
df21

  key  data1  data2
1   B      1      6
2   C      2      1
4   B      4      6
5   C      5      2

In [175]:
print(df)
df.groupby('key').transform(lambda X:X**(1/2))

  key  data1  data2
0   A      0      4
1   B      1      6
2   C      2      1
3   A      3      9
4   B      4      6
5   C      5      2

      data1     data2
0  0.000000  2.000000
1  1.000000  2.449490
2  1.414214  1.000000
3  1.732051  3.000000
4  2.000000  2.449490
5  2.236068  1.414214

## Data Transformation and Handling Missing Data

###  Dropping Unnecessary Data
Dropping helps in focusing on what's essential by removing unneeded data.

In [187]:
# Sample DataFrame with unnecessary data

data = {'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 22],
 'Unneeded_Column': ['A', 'B', 'C']}

df = pd.DataFrame(data)
print(df)

df=df.drop(columns='Unneeded_Column')
df

      Name  Age Unneeded_Column
0    Alice   25               A
1      Bob   30               B
2  Charlie   22               C

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22

#####  Dropping Rows with Any Missing Values

In [ ]:
import pandas as pd


# Sample DataFrame with missing values
data = {'Name': ['Alice', 'Bob', None, 'Charlie'],
 'Age': [25, 30, None, 22],
 'Salary': [50000, None, 60000, 70000]}

df = pd.DataFrame(data)
print(df)

#Drop the entire row if there is any one missing data
df_clean = df.dropna()

print("\nDataFrame with all rows without missing value ")
print(df_clean)

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0      NaN
2     None   NaN  60000.0
3  Charlie  22.0  70000.0

DataFrame with all rows without missing value
      Name   Age   Salary
0    Alice  25.0  50000.0
3  Charlie  22.0  70000.0

In [202]:
df2=df.drop(2,axis=0)
print(df2)

print("\n",df2.drop(3,axis=0))

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0      NaN
3  Charlie  22.0  70000.0

     Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob  30.0      NaN